[
    {
        "created": 1528367526000,
        "description": "<p>24h HACKATHON ALLEGRO TECH DAYS W WARSZAWIE</p> <p>Wkręć się z nami w Rowerową Polskę -<br/>serwis dla rowerzystów, społeczności lokalnych i samorządów!</p> <p>Szukamy programistów / grafików / specjalistów UX i data scientist gotowych w kreatywny sposób podejść do danych o aktywnościach rowerowych Polaków.<br/>Na podstawie udostępnionych przez nas wycinków danych rowerowych (bez danych wrażliwych) i listy tematów do wyboru lub inspiracji uczestnicy będą tworzyć serwis zawierający mapy cieplne aktywności rowerowych w polskich miastach, analizy tras i inne rozwiązania służące lokalnym społecznościom i samorządom.</p> <p>START piątek[masked] o 18:00<br/>KONIEC sobota[masked] o 18:00<br/>MIEJSCE PGE Narodowy, Warszawa</p> <p>Może szukamy właśnie Ciebie?</p> <p>Do udziału zapraszamy gotowe (max. 4-osobowe) zespoły oraz pojedyncze osoby, które na miejscu uformują drużyny lub dołączą do istniejących.</p> <p>Limit miejsc: 60</p> <p>Najlepsza drużyna na HACKATHON ALLEGRO TECH DAYS podzieli się kwotą 4 000 złotych!</p> <p>Na wydarzeniu gwarantujemy świetną atmosferę, wifi i kreatywne miejsce pracy, pyszny catering oraz pomoc merytoryczną mentorów – inżynierów Allegro, skupionych pod marką Allegro Tech.</p> <p>Więcej informacji i zapisy na <a href=\"http://kreckilometry.pl/hackathon\" class=\"linkified\">http://kreckilometry.pl/hackathon</a></p> ",
        "duration": 86400000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "251510035",
        "link": "https://www.meetup.com/allegrotech/events/251510035/",
        "local_date": "2018-06-15",
        "local_time": "18:00",
        "name": "Hackathon Allegro Tech Days Warszawa - ZAPISY!",
        "status": "upcoming",
        "time": 1529078400000,
        "updated": 1528368141000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "Aleja Poniatowskiego 1,",
            "city": "Warsaw",
            "country": "pl",
            "id": 25285139,
            "lat": 52.23946762084961,
            "localized_country_name": "Poland",
            "lon": 21.045801162719727,
            "name": "Stadion PGE Narodowy",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 7
    },
    {
        "created": 1526360185000,
        "description": "<p>Chcesz posłuchać o Machine Learning w Allegro? Zarejestruj się na kolejny Allegro Tech Talks w Poznaniu!</p> <p>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia. Po zarejestrowaniu otrzymasz e-mail z potwierdzeniem oraz Twoim biletem.</p> <p>Agenda:</p> <p>17:45 - Rejestracja<br/>18:00 - Przywitanie<br/>18:05 - Piotr Wikieł - \"Fast.ai - jak zagłębić się w głębokie sieci?\"<br/>18:35 - 18:50 - przerwa<br/>18:50 - 19:20 - Piotr Jankowiak - “Jak wydobyć wszystko co możliwe z posiadanych danych?”<br/>19:20 - 20:00 - Krzysztof Dębski - “Jak nie odbić się od ściany przy wdrażaniu Machine Learning?”<br/>20:00 - zakończenie</p> <p>1. \"“Fast.ai — jak zagłębić się w głębokie sieci?”</p> <p>Na rynku jest wiele bibliotek i frameworków stworzonych do uczenia głębokich sieci neuronowych. Niektóre z nich (np. Tensorflow) są bardzo rozbudowane, natomiast próg wejścia — zwłaszcza dla ludzi, który z ML nie mieli do czynienia — jest dość wysoki. Inne są przestarzałe, jeszcze inne mają piękne API, ale małą liczbę funkcji lub opierają uczenie na klasycznych metodach. fast.ai w pewien sposób zapełnia tę lukę. Stworzył ją były szef Kaggle by udostępnić deep learning masom. Jeśli chciałbyś zacząć naukę ML, a podchodzisz do tego jak pies do jeża, wpadnij i przekonaj się, że ów jeż to całkiem sympatyczne stworzonko.</p> <p>Piotr Wikieł — inżynier platformy danych szczególnie lubujący się w rozwiązaniach z pogranicza programowania i machine learningu. Aktualnie członek zespołu utrzymującego ekosystem Hadoopowy w Allegro. Zainteresowania: monotonna muzyka i nudne książki.</p> <p>2. \"Jak wydobyć wszystko co możliwe z posiadanych danych?”</p> <p>Jakość i użyteczność modeli machine learningowych bardzo mocno zależy od tego, jakie będziemy mieć dane. Jeżeli na samym początku uda się podstawowy zbiór danych wzbogacić o dodatkowe informacje (czasem publicznie dostępne) lub sprytnie go przekształcić to model znacznie zyska na wartości. Na przykładzie ostatnich wydarzeń ze świata dotyczących przecieków danych pokaże jak użyteczne i pozornie nieszkodliwe narzędzia i informacje mogą się zamienić w kopalnię złota lub broń. Będę opowiadać m.in. o machine learningu, szpiegostwie, geografii i chińskich kredytach.</p> <p>Piotr Jankowiak - data scientist w zespole Search, gdzie bada to, jak zachowują się użytkownicy Allegro. Interesuje się najnowszymi odkryciami naukowymi, developmentem gier komputerowych oraz programowaniem.</p> <p>3. “Jak nie odbić się od ściany przy wdrażaniu Machine Learning?\"</p> <p>Wszyscy lubimy uczyć się nowych narzędzi i technik. Dostajemy wtedy nową magiczną różdżkę do ręki. Ostatnio taką technologią staje się Machine Learning. Podchodząc do niej widzimy wiele problemów, które moglibyśmy za jej pomocą rozwiązać. Na początku wszystko wygląda bardzo dobrze. Mamy dane wejściowe i wiemy co powinno być na wyjściu. Dość szybko okazuje się jednak, że jeśli nie masz dobrej wiedzy na temat swojego problemu, znacznie łatwiej jest zbudować rozwiązanie za pomocą prostszych narzędzi.<br/>W czasie prezentacji omówię problemy, które spotyka się przy budowaniu modeli i próbach ich późniejszego wdrożenia. Popatrzymy też na przykłady gdzie nie używać Machine Learningu.</p> <p>Krzysztof Dębski - inżynier, architekt oraz techniczny właściciel produktów w Allegro. Posiada eksperckie doświadczenie w projektowaniu i budowaniu wysokowydajnych, rozproszonych aplikacji. Jest fanem transformacji technologicznych monolitów. Po godzinach fan snowboardu.</p> ",
        "duration": 8100000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "250799242",
        "link": "https://www.meetup.com/allegrotech/events/250799242/",
        "local_date": "2018-05-21",
        "local_time": "17:45",
        "name": "Allegro Tech Talks Poznań #10 - Machine Learning ",
        "status": "past",
        "time": 1526917500000,
        "updated": 1526928934000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 81
    },
    {
        "created": 1525466265000,
        "description": "<p>AGENDA:</p> <p>1. Co w kubernetsowej sieci piszczy? (Tomasz Ziółkowski)</p> <p>NodePort, Ingress, Pod - jeśli słysząc te pojęcia, czujesz lekki niepokój, ta prelekcja pozwoli Ci go przezwyciężyć. Chciałbym przybliżyć koncepcję rozwiązań sieciowych w kubernetsach. Przechodząc od szczegółu do ogółu, opowiem o:<br/>- organizacji sieci na poziomie kontenerów i pod-ów,<br/>- usługach wprowadzających abstrakcję sieciową, pozwalająca na efemeryczność pod-ów,<br/>- sposobie, w jaki klienci zewnętrzni mogą skomunikować się z kontenerami (routing aplikacyjny, load balancing).</p> <p>2. LinkedIn dla pracowników branży IT. Jak zbudować profil, który zaciekawi rekruterów? (Matylda Ryś)</p> <p>LinkedIn to narzędzie dostępne dla każdego, które, odpowiednio wykorzystane, bardzo pomaga w procesie poszukiwania pracy i rozwoju zawodowego. Jak każde narzędzie wymaga chwilę cierpliwości i odrobinę poświęconego czasu, aby jego użytkowanie nie sprawiało problemów. Prezentacja ma na celu pokazanie możliwości portalu, wskazanie, czym różni się od innych platform społecznościowych i wreszcie jak wykorzystać go w procesie budowania profilu zawodowego. Wszystko po to, aby rekruterzy zainteresowali się Twoją osobą i w efekcie żebyś dostał dobrze płatną, satysfakcjonującą pracę, w której będziesz mógł rozwijać swoje umiejętności.</p> <p>PRELEGENCI:</p> <p>Tomasz Ziółkowski - Team Leader w Allegro Group. Wieloletni developer php-owej aplikacji Allegro. Współtwórca oprogramowania ułatwiającego zarządzanie varnish-ami - VaaS (<a href=\"http://vaas.readthedocs.io/en/latest/\" class=\"linkified\">http://vaas.readthedocs.io/en/latest/</a>). Entuzjasta idei „Infrastructure as a code” i kultury devops.</p> <p>Matylda Ryś - od dwóch lat związana z branżą marketingową. Pasjonatka ciekawych kreacji reklamowych i nowych mediów. Studiuje lingwistykę praktyczną i copywriting, a od pewnego czasu podpowiada innym, jak stworzyć profil na LinkedIn, który umożliwi znalezienie fajnej pracy.</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "250462564",
        "link": "https://www.meetup.com/allegrotech/events/250462564/",
        "local_date": "2018-05-09",
        "local_time": "18:00",
        "name": "Meet IT Toruń # 21",
        "status": "past",
        "time": 1525881600000,
        "updated": 1525903842000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "ul. Kościuszki 71",
            "city": "Toruń",
            "country": "pl",
            "id": 24266096,
            "lat": 53.02497482299805,
            "localized_country_name": "Poland",
            "lon": 18.625661849975586,
            "name": "Kościuszko Business Point",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 25
    },
    {
        "created": 1522934127000,
        "description": "<p>24 h kodowania, niesamowici ludzie, kreatywne projekty, rywalizacja o nagrody i miejsce w programie stażowym... Już dziś zapisz się na BrainCode 2018! Spotykamy się w Warszawie, Poznaniu i Torunu.</p> <p>Tegoroczna edycja kierowana jest w pierwszej kolejności do osób zainteresowanych udziałem w rekrutacji do letniego programu stażowego Summer e-Xperience. Aż 8 uczestników zeszłorocznej edycji BrainCode dostało się na płatny staż w Allegro!</p> <p>SZCZEGÓŁY ORAZ REJESTRACJA NA STRONIE: <a href=\"https://allegro.tech/braincode/\" class=\"linkified\">https://allegro.tech/braincode/</a></p> <p>BrainCode to niezwykła szansa na zmierzenie się z zadaniami i problemami, z którymi na co dzień mierzą się nasi programiści. To idealne miejsce dla każdego, kto chciałby zobaczyć jak wygląda praca w jednej z największych firm technologicznych w Polsce. Uczestnicy będą mieć dobę, aby przy dostępie do wszystkich potrzebnych danych i narzędzi oraz wsparciu naszych inżynierów zmierzyć się z tematem „Allegro | Po drugiej stronie platformy” – czyli zadaniami przygotowanymi na bazie tych, nad którymi na co dzień pracują nasi programiści. Możesz zarówno wybrać zadanie przygotowane przez naszych inżynierów i zobaczyć jak wygląda ich praca na codzień lub stworzyć swój projekt, propozycję usprawnienia działania Allegro w zaproponowanych przez nas kategoriach.</p> ",
        "duration": 90000000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "249458085",
        "link": "https://www.meetup.com/allegrotech/events/249458085/",
        "local_date": "2018-04-20",
        "local_time": "17:00",
        "name": "BrainCode 2018",
        "status": "past",
        "time": 1524236400000,
        "updated": 1524492457000,
        "utc_offset": 7200000,
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 21
    },
    {
        "created": 1523263092000,
        "description": "<p>We would like to invite you to the next Allegro Tech Talks Meetup in Kraków. This time, we are holding a Machine Learning edition. We’d like to describe ML techniques that enable some of Allegro’s intelligent algorithms running in production: accurate image assessment and fast approximate search.</p> <p>REMEMBER TO REGISTER!<br/>WITHOUT QRCODE YOU WON'T BE ABLE TO ENTER THE MEETUP<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a></p> <p>Note: Both presentations will be delivered in English.<br/>Place: Browar Lubicz, Lubicz 17J, Kraków, Poland<br/>Agenda:</p> <p>18:00 - registration + beer</p> <p>18:30 - A case-study of CNNs and transfer learning for image quzlity assessment at Allegro - Ireneusz Gawlik, Tomasz Bartczak</p> <p>19:30 - Approximate nearest neighbors search - Karol Grzegorczyk, Marcin Cylke</p> <p>20:30 - networking</p> <p>1. A case-study of CNNs and transfer learning for image quality assessment at Allegro – Ireneusz Gawlik, Tomasz Bartczak<br/>Abstract:</p> <p>As allegro.pl marketplace is getting more professional, content quality assessment becomes more and more important. We employed deep learning techniques to ensure proper quality of images, pushing offers that fail to fulfil our guidelines further down the search results.</p> <p>During our talk, we will describe how we approached image quality assessment, starting with classical computer vision based solution and moving later to CNN based transfer learning approach. We will share lots of experience gathered during our journey – regarding dataset building, model training and evaluation, hyperparameters tuning, and last but not least, production deployment.</p> <p>Speakers bio:</p> <p>Ireneusz and Tomasz are members of Machine Learning Research team at Allegro. Tomasz has a strong Software Engineering background and made a shift towards the field of Machine Learning in recent years. Ireneusz has several years of experience with machine learning R&amp;D projects in academia and has been developing intelligent algorithms at Allegro for a couple of years. He is also working toward his PhD degree at AGH UST.</p> <p>2. Approximate nearest neighbors search – Karol Grzegorczyk, Marcin Cylke<br/>Abstract:</p> <p>Many dense vector representations of different kinds of data have been proposed recently. One of their applications is similarity search, a.k.a. nearest neighbor search. Due to the high computational complexity of exact methods, it is often necessary to rely on some approximation. In the first part of this talk, we will review and compare existing approximate nearest neighbors algorithms and solutions. In the second part, we will focus on learning to hash for text documents and we will present our research results in this area.</p> <p>Speakers bio:</p> <p>Marcin and Karol are members of Allegro’s recommender system team. Marcin is an engineer deeply rooted in software design and architecture, recently shifting his interests towards data science. Karol is interested in machine learning (embedding methods in particular), distributed systems, and big data.</p> ",
        "duration": 9000000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "249592290",
        "link": "https://www.meetup.com/allegrotech/events/249592290/",
        "local_date": "2018-04-19",
        "local_time": "18:00",
        "name": "Allegro Tech Talks Kraków #3 - ML Edition",
        "status": "past",
        "time": 1524153600000,
        "updated": 1524168120000,
        "utc_offset": 7200000,
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 62
    },
    {
        "created": 1522850690000,
        "description": "<p>Wymagana rejestracja na wydarzenie!<br/><a href=\"https://www.picatic.com/event15228507825812\" class=\"linkified\">https://www.picatic.com/event15228507825812</a><br/>Zapraszamy z otrzymanym mailowo QRcodem</p> <p>Przedstawiamy Wam nową inicjatywę Allegro Tech: Allegro Tech Labs. Jest to cykl całodniowych, darmowych warsztatów w czasie których będziecie mogli poznać technologie z jakich korzystamy w Allegro. Prowadzone przez doświadczonych inżynierów, którzy rozwiązali już niejeden produkcyjny problem.</p> <p>Zapraszamy na trzecie warsztaty Allegro Tech Labs w Warszawie, tym razem o tematyce stabilnych mikrousług.</p> <p>Agenda wydarzenia:<br/>09:00 - 09:20 - Rejestracja<br/>09:20 - 12:00 - Warsztaty<br/>12:00 - 13:00 - Lunch<br/>13:00 - 17:00 - Warsztaty</p> <p>Architektura mikrousługowa oprócz korzyści w postaci szybszego, niezależnego wdrażania funkcjonalności i jasnego określenia odpowiedzialności niesie ze sobą także wiele wyzwań. Oprócz budowy infrastruktury, krytyczna jest inwestycja w stabilność działania każdej z nich. W czasie warsztatu chcemy podzielić się doświadczeniami wyniesionymi z budowy systemu złożonego z kilkuset mikrousług w Allegro. Rafał Głowiński (odpowiedzialny technologicznie za platformę Allegro Ads) oraz Adam Dubiel (team leader zespołu Skylab) na praktycznych przykładach pokażą jakie są podstawowe zagrożenia dla stabilności mikrousług i jak się przed nimi chronić korzystając z ogólnodostępnych narzędzi.</p> <p>Poruszane zagadnienia:<br/>- konfiguracja klientów do systemów zewnętrznych (bazy danych, http)<br/>- izolacja obsługi requestów<br/>- serwery http<br/>- wpływ GC na działanie aplikacji</p> <p>Must have: dobra znajomość Java 8 i Spring 4.x</p> <p>Część praktyczna warsztatów odbywa się na komputerach uczestników, na których zainstalowane powinny być: JDK 8, IDE (najlepiej Idea), git oraz Vagrant 2.x (z silnikiem do wirtualizacji).</p> <p>Prowadzący:</p> <p>Adam Dubiel<br/>Programista z pasją do tworzenia stabilnych i wydajnych rozwiązań. Od ponad pięciu lat pracuje w Allegro, gdzie zaczynał jako starszy programista Java. Obecnie lider zespołu developerskiego odpowiedzialny za usługi będące fundamentem platformy Allegro. Oprócz problemów technicznych lubi mierzyć się z problemami organizacyjnymi oraz zmieniać otoczenie na lepsze. Jako prelegent występuje na polskich i europejskich konferencjach IT.</p> <p>Rafał Głowiński<br/>Doświadczony inżynier oprogramowania, który większość kariery spędził pracując z językiem Java. Od dwóch lat entuzjasta Kotlina. W codziennej pracy zwraca uwagę przede wszystkim na jakość kodu, stabilność oraz skalowalność rozwiązań. Interesuje się także analizą wydajności aplikacji oraz architekturą systemów rozproszonych.</p> ",
        "duration": 28800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "249421556",
        "link": "https://www.meetup.com/allegrotech/events/249421556/",
        "local_date": "2018-04-14",
        "local_time": "09:00",
        "name": "Allegro Tech Labs #3 Warszawa",
        "status": "past",
        "time": 1523689200000,
        "updated": 1523723137000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "al. Jana Pawła II 22, Warszawa",
            "city": "Warsaw",
            "country": "pl",
            "id": 25185284,
            "lat": 52.23618698120117,
            "localized_country_name": "Poland",
            "lon": 20.999486923217773,
            "name": "Allegro Office Q22",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 29
    },
    {
        "created": 1522855362000,
        "description": "<p>Allegro Tech Labs to całodniowe, darmowe warsztaty w czasie których będziecie mogli poznać technologie z jakich korzystamy w Allegro. Prowadzone przez doświadczonych inżynierów, którzy rozwiązali już niejeden produkcyjny problem.</p> <p>Warsztaty prowadzone będą w języku polskim.</p> <p>Prosimy o zabranie swoich laptopów.</p> <p>BEZ ZAREJESTROWANIA SIĘ NIE MA MOŻLIWOŚCI UCZESTNICZENIA W WARSZTATACH!</p> <p>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia.</p> <p>Agenda wydarzenia:<br/>08:40 - 09:00 - Rejestracja<br/>09:00 - 12:00 - Warsztaty<br/>12:00 - 13:00 - Lunch<br/>13:00 - 16:00 - Warsztaty</p> <p>Jeśli termin IoT (nie) jest Tobie obcy i zabrakło Ci czasu lub pomysłu, żeby zagłębić się w temat to masz teraz okazję.<br/>Arkadiusz Baraniecki, Artur Maćkowiak i Michał Śmigielski pokażą Wam jak rozpocząć przygodę z układem esp8266.</p> <p>Poruszane zagadnienia:<br/>- Arduino<br/>- Micropython<br/>- Automatyka domowa<br/>- Inteligentny dom</p> <p>Wymagania w stosunku do uczestników:</p> <p>Must have:<br/>Podstawowa znajomość C lub Pythona<br/>Laptop z portem USB (w przypadku nowych MacBook im prostsza przejściówka tym lepiej)<br/>Znajomość terminala (dotyczy również windows)<br/>Zainstalowany program do łączenia się portem seryjnym (np. screen dla linux i osx, putty dla Windows)<br/>Git dostępny z poziomu konsoli</p> <p>Nice to have:<br/>Python 3.6 (w przypadku windows konieczne zaznaczenie opcji “For all users”)</p> <p>Prowadzący:</p> <p>Arkadiusz Baraniecki<br/>Kierownik w Allegro. Przedtem programista i administrator systemów. Obecnie miłośnik pythona. Hobbystycznie zajmuje się IoT.</p> <p>Michał Śmigielski<br/>System Engineer w Allegro, gdzie od ponad 10 lat zajmuje się utrzymaniem infrastruktury systemowej i sieciowej. W wolnej chwili zajmuje się IOT i majsterkowaniem.</p> <p>Artur Maćkowiak<br/>Senior System Engineer w Allegro. Zajmuję się systemami od prawie 10 lat. Natomiast w Allegro wspiera utrzymanie infrastruktury do ponad 5 lat. Jest jednym współtwórców oprogramowania ułatwiającego zarządzanie konfiguracją reverse proxy o nazwie VaaS. Zwolennik wolnego oprogramowania jak i IoT.</p> ",
        "duration": 26400000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "249424067",
        "link": "https://www.meetup.com/allegrotech/events/249424067/",
        "local_date": "2018-04-14",
        "local_time": "08:40",
        "name": "Allegro Tech Labs Poznań #3 - Arduino, Micropython, Automatyka domowa",
        "rsvp_limit": 25,
        "status": "past",
        "time": 1523688000000,
        "updated": 1523718194000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 15
    },
    {
        "created": 1522229707000,
        "description": "<p>Drogie Koleżanki, Drodzy Koledzy!<br/>Jako że w kwietniu przypadają 10-te Urodziny toruńskiego biura Allegro, to zapraszamy Was na wspólne świętowanie :))) Nie dość, że zapowiadają się naprawdę ciekawe prezentacje, to w dodatku czekać na Was będą miłe niespodzianki.</p> <p>AGENDA:</p> <p>1. Od[masked] do ceeh5doodame (Błażej Miga)<br/>W ostatnim roku wyciekło przeszło 1,3 miliarda użytkowników i haseł w różnych serwisach. Prezentacja ta to próba odpowiedzi na pytania: ile czasu mamy, zanim blackhat’ci poznają nasze zahashowane hasła? ile warte jest hasło? co zdradza hasło? jak stworzyć hasło doskonałe?</p> <p>2. Co robi Twoja aplikacja, kiedy nie patrzysz? (Adam Dubiel)<br/>Jaki jest 99 percentyl czasu odpowiedzi Twojej aplikacji? Ile czasu zabiera zapis do bazy danych? Jak nie dać się zaskoczyć awarii? Odpowiedź na te pytania jest prosta, jeśli zbierasz metryki. To najlepsze źródło wiedzy o aplikacji, do tego aktualizowane real-time. Dobrze zbierane i prezentowane w czasie spokoju, dają uczucie, że “system działa”, a gdy wszystko się wali, pozwalają szybko dotrzeć do przyczyny. Co warto mierzyć? Jakimi narzędziami? Jakie pułapki na nas czekają? Gdzie agregować? Jak prezentować? To wszystko chcę przekazać podczas prezentacji. Trochę teorii, dużo działających przykładów, żebyś po prezentacji wiedział/-a, co Twoja usługa robi o każdej porze dnia i nocy.</p> <p>3. Hackowanie z MySQL-em dla zabawy, lecz bez profitu (Piotr Jarmuż)<br/>Podczas tej prezentacji z działającym demo pokażę zaawansowane użycie procedur składowanych MySQL-a. Zbiór procedur implementuje programowanie dynamiczne z decyzyjnym obcinaniem drzewa poszukiwań w celu rozwiązania w ciągu kilku sekund popularnej gry o nazwie Wordament (polska wersja to Słowotok). To jest projekt hobby, lecz zastosowana technika może zostać użyta do rozwiązywania rzeczywistych problemów. Ten przykład pokazuje, że dawno minęły dni, gdzie MySQL był zwykłym magazynem danych. Teraz moc procedur składowanych może zostać wykorzystana do rozwiązywania rzeczywistych wyzwań wewnątrz silnika bazodanowego, czyli blisko danych. W ten sposób MySQL pokazuje swoje drugie oblicze jako potężne rozproszone środowisko obliczeniowe.</p> <p>4. User driven radio station (Michał Ferchow)<br/>Over-engineering? A może zwykła głupota? Opowiadam o losach jednego z moich projektów na boku i jakich nieoczywistych rzeczy nauczyłem się, pracując nad nim.</p> <p>PRELEGENCI:</p> <p>Błażej Miga<br/>Od 15 lat na dobre i na złe z Eweliną, 2 córki + pies :) Prawie 10 lat w Allegro, pasjonat bezpieczeństwa.</p> <p>Adam Dubiel<br/>programista z pasją do tworzenia wydajnych i dobrze skalujących się aplikacji. Kiedy programuje, zwraca uwagę na czystość kodu, architekturę i testy, ale także na metryki. Lider techniczny, który lub zmieniać otoczenie na lepsze. Największą satysfakcję daje mu udane wdrożenie aplikacji, która po prostu działa oraz zadowolenie klientów.</p> <p>Piotr Jarmuż<br/>Straszy inżynier baz danych. Rozpocząłem swoja przygodę w IT jako programista w C w 2001, potem pojawiła się Java i Perl. Pracowałem w Polsce i Niemczech przy wielu międzynarodowych projektach. W każdym z tych projektów miałem do czynienia w ten czy inny sposób z relacyjnymi bazami danych od storny deweloperskiej, aż w jednym z projektów stanąłem po drugiej stronie i zrozumiałem moc SQL-a. Od tej pory pracowałem głównie jako administrator baz danych. W latach[masked] pracowałem jako starszy administrator Oracle, a w ostatnim roku jako architekt systemowy na poziomie całgeo GSK. Od stycznia 2011 do tej pory pracuję dla Allegro jako starszy administrator baz danych. W zespole zarządzamy wieloma klustrami Oracle'a, Postgresa i MySQLa. Samego Allegro przedstawiać nie trzeba, powiem tylko, że mamy ponad 20 milionów użytkowników, a liczba danych relacyjnych to w tej chwili wiele setek terabytów.</p> <p>Michał Ferchow:<br/>Inżynier oprogramowania w Allegro i student informatyki na UMK. Na co dzień pracuje w zespole opiekującym się widokiem oferty. W wolnym czasie szuka ciekawych, ale nie zawsze przydatnych zastosowań technologii.</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "249185099",
        "link": "https://www.meetup.com/allegrotech/events/249185099/",
        "local_date": "2018-04-04",
        "local_time": "18:00",
        "name": "Meet IT Toruń # 20 i 10-te Urodziny toruńskiego biura Allegro",
        "status": "past",
        "time": 1522857600000,
        "updated": 1523021656000,
        "utc_offset": 7200000,
        "venue": {
            "address_1": "ul. Kościuszki 71",
            "city": "Toruń",
            "country": "pl",
            "id": 24266096,
            "lat": 53.02497482299805,
            "localized_country_name": "Poland",
            "lon": 18.625661849975586,
            "name": "Kościuszko Business Point",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 54
    },
    {
        "created": 1520611246000,
        "description": "<p>Allegro Tech Labs to całodniowe, darmowe warsztaty w czasie których będziecie mogli poznać technologie z jakich korzystamy w Allegro. Prowadzone przez doświadczonych inżynierów, którzy rozwiązali już niejeden produkcyjny problem.</p> <p>Ze względu na bardzo duże zainteresowanie postanowiliśmy ponownie zorganizować warsztat z wprowadzenia do języka programowania Kotlin. Warsztaty prowadzone będą w języku polskim.</p> <p>Prosimy o zabranie swoich laptopów.</p> <p>BEZ ZAREJESTROWANIA SIĘ NIE MA MOŻLIWOŚCI UCZESTNICZENIA W WARSZTATACH!</p> <p>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia.</p> <p>Agenda wydarzenia:<br/>09:00 - 09:20 - Rejestracja<br/>09:20 - 12:00 - Warsztaty<br/>12:00 - 13:00 - Lunch<br/>13:00 - 17:00 - Warsztaty</p> <p>Kotlin przebojem wdarł się na produkcję Allegro. Nasza nowa platforma do promowania ofert Allegro Ads prawie w całości została napisana w tym języku. Co ważne, nie tylko korzystamy z Kotlina - nasi inżynierowie biorą także aktywny udział w rozwoju jego ekosystemu. W czasie warsztatu Konrad Kamiński (autor integracji kotlinowych coroutines ze Spring) oraz Piotr Procner (inżynier Allegro) przybliżą Wam możliwości tego języka oraz pokażą jak w praktyce wykorzystać jego moc do pisania aplikacji biznesowych na Spring.</p> <p>Poruszane zagadnienia:<br/>- Data, czyli jak wykorzystać Kotlin do sprawnej organizacji danych w aplikacji.<br/>- Behaviour, czyli konstrukcje do opisu logiki w aplikacji.<br/>- Standard library, czyli co daje bibliotek standardowa Koltina.<br/>- Interop, czyli jak wprowadzić Kotlin do aplikacji biznesowej.</p> <p>Wymagania w stosunku do uczestników:<br/>Must have: dobra znajomość Java 8 i Spring 4.x<br/>Nice to have: znajomość Spock (framework testowy) i Gradle (build tool)</p> <p>Część praktyczna warsztatów odbywa się na komputerach uczestników, na których zainstalowane powinny być: JDK 8, IDE (najlepiej Idea), git</p> <p>Prowadzący:</p> <p>Konrad Kamiński<br/>Inżynier oprogramowania z dwudziestoletnim doświadczeniem na różnych stanowiskach - od developera po team ledera. Przez ostatnie 17 lat programował w technologiach opartych na JVM, w tym ostatnie 18 miesięcy prawie wyłącznie w Kotlinie. Prowadzi bloga i występuje na konferencjach (ostatnio KotlinConf San Francisco). Jest też kontrybutorem do projektów Open Source.</p> <p>Piotr Procner<br/>Full Stack developer z ponad sześcioletnim doświadczeniem. Swoją przygodę rozpoczął w branży mediowej od projektowania archiwów cyfrowych, teraz tworzy platformę reklamową dla Allegro. Wielki fan Kotlina, zainteresowany wytwarzaniem czystego kodu, dobrym nazewnictwem i czytelnością testów.</p> ",
        "duration": 28800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "248573563",
        "link": "https://www.meetup.com/allegrotech/events/248573563/",
        "local_date": "2018-03-17",
        "local_time": "09:00",
        "name": "Allegro Tech Labs Poznań #2 - Język programowania Kotlin",
        "rsvp_limit": 25,
        "status": "past",
        "time": 1521273600000,
        "updated": 1521305846000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 18
    },
    {
        "created": 1520837386000,
        "description": "<p>• What we'll do<br/>AGENDA:</p> <p>1. Test your @Validation (Wojciech Rezulak)<br/>Walidacja danych wejściowych za pomocą adnotacji w Springu oraz testy jednostkowe walidatorów.</p> <p>2. Seca dzień powszedni (Paweł Czubachowski)<br/>Zostałem poproszony aby opowiedzieć uczniom technikum jak wygląda i z czym się wiąże praca w zespole bezpieczeństwa. Postanowiłem to rozszerzyć i przekazać to także uczestnikom Meet It Toruń. Z doświadczenia wiem, że temat jest mało znany, za to bardzo lubiany, a zapotrzebowanie na specjalistów rośnie. Opowiem jak wygląda moja zawodowa codzienność i że psucie rzeczy także przynosi zysk.</p> <p>PRELEGENCI:</p> <p>Wojciech Rezulak - inżynier oprogramowania w Allegro od 2008r. Przez blisko 18 lat swojej pracy zawodowej tworzył rozwiązania w wielu językach, m.in.: PHP, JavaScript, Java, Groovy, Scala. Zagorzały wyznawca reguły KISS oraz ścisłej współpracy programistów z biznesem.</p> <p>Paweł Czubachowski - Pracuję w allegro w zespole bezpieczeństwa webaplikacji, gdzie zajmuję się testami penetracyjnymi oraz automatyzacją narzędzi i procesów wspomagających pracę zespołu bezpieczeństwa. Jako bug hunter pomagam także dbać o bezpieczeństwo innych organizacji. Od czasu do czasu podddaję się stresowi, występując z publiczną prezentacją.</p> <p>• What to bring</p> <p>• Important to know</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "248654625",
        "link": "https://www.meetup.com/allegrotech/events/248654625/",
        "local_date": "2018-03-14",
        "local_time": "18:00",
        "name": "Meet IT Toruń # 19",
        "status": "past",
        "time": 1521046800000,
        "updated": 1521062846000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "ul. Kościuszki 71",
            "city": "Toruń",
            "country": "pl",
            "id": 24266096,
            "lat": 53.02497482299805,
            "localized_country_name": "Poland",
            "lon": 18.625661849975586,
            "name": "Kościuszko Business Point",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 27
    },
    {
        "created": 1519831961000,
        "description": "<p>Zapraszamy na kolejny Allegro Tech Talks w Poznaniu! Tym razem poruszymy tematykę Cassandry i Scylli.</p> <p>Agenda:</p> <p>17:45 - Rejestracja<br/>18:00 - Przywitanie<br/>18:05 - Piotr Jastrzębski (ScyllaDB) - \"Skalować bazę horyzontalnie czy wertykalnie? Ze ScyllaDB możesz wybrać oba!\"<br/>18:35 - Szymon Szymański i Łukasz Pachciarek - \"Wyniki testów porównawczych na ruchu produkcyjnym.\"<br/>19:00 - Krzsztof Grzempa - \"Hekabe - backup dla Cassandry i Scylli.\"<br/>19:30 - zakończenie<br/>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia. Po zarejestrowaniu otrzymasz e-mail z potwierdzeniem oraz Twoim biletem.</p> <p>1. \"Skalować bazę horyzontalnie czy wertykalnie? Ze ScyllaDB możesz wybrać oba!\"</p> <p>Istnieją dwie metody skalowania aplikacji: horyzontalna i wertykalna. Aby któraś z nich działała na dany program, musi on być specjalnie zaprojektowany. Liniowa skalowalność horyzontalna ScyllaDB jest powszechnie znana. Przedstawię wyniki eksperymentu obrazującego skalowalność wertykalną ScyllaDB na przykładzie różnych kategorii instancji AWS.</p> <p>Piotr Jastrzębski - Inżynier oprogramowania z dziesięcioletnim stażem. Aktualnie pracuje nad rozproszoną bazą danych NoSQL - ScyllaDB. Wcześniej rozwijał real-time trading systemem w londyńskim City oraz pracował nad systemem Android w firmie Google.</p> <p>2. \"Wyniki testów porównawczych na ruchu produkcyjnym.\"</p> <p>Wyniki testów porównawczych Cassandry i Scylli. Najbardziej wiarygodne testy to te - przeprowadzone na ruchu produkcyjnym. Kierując się tą zasadą stworzyliśmy w Allegro środowisko pozwalające w bezpieczny sposób wpiąć klaster Scylli do ruchu produkcyjnego kierowanego do klastra Cassandry. Otrzymane wyniki były bardzo obiecujące a podczas naszej prezenteacji będziemy mogli szerzej o nich opowiedzieć.</p> <p>Łukasz Pachciarek - administrator baz danych z wieloletnim doświadczeniem, aktualnie wspiera bazy NoSQL w Allegro.</p> <p>Szymon Szymański - administrator systemów Linux/Unix, od 4 lat w zespole wspierającym bazy NoSQL w Allegro.</p> <p>3. \"Hekabe - backup dla Cassandry i Scylli.\"</p> <p>Cassandra nie dostarcza pełnego mechanizmu pozwalającego na backup dla całego klastra. W Allegro korzystamy z własnego rozwiązania, które w inteligentny i bezpieczny sposób pozwala archiwizować i składować olbrzymie ilości danych. Opowiem o architekturze i sposobie działania Hekabe.</p> <p>Krzysztof Grzempa - administrator i programista, współautor Hekabe.</p> ",
        "duration": 11700000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "248262307",
        "link": "https://www.meetup.com/allegrotech/events/248262307/",
        "local_date": "2018-03-12",
        "local_time": "17:45",
        "name": "Allegro Tech Talks Poznań #9 - Cassandra i Scylla",
        "status": "past",
        "time": 1520873100000,
        "updated": 1520889702000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 71
    },
    {
        "created": 1518610821000,
        "description": "<p>Zapraszamy na kolejny Allegro Tech Talks w Poznaniu. Tym razem poruszymy tematykę Python i Devops! Agenda:<br/>17:45 - 18:00 - Rejestracja<br/>18:00 - 18:30 - Marcin Kliks - \"5 sekretów dobrych inżynierów oprogramowania.\"<br/>18:30 - 19:00 - Roman Prykhodchenko - \"Dystrybucja obciążenia w heterogenicznym świecie mikrousług.\"<br/>19:00 - 19:20 - Arkadiusz Adamski - \"Swiss Army Knife Pythonisty - ciekawe narzędzia developerskie.\"<br/>19:20 - 19:40 - przerwa<br/>19:40 - 20:10 - Marek Bleschke - “Typehinty Pythonowe w produkcji - czy warto?”<br/>20:10 - 20:40 - Tetiana Khotiaintseva - \"Phobos - Intuition engineering w Allegro.\"<br/>20:40 - Zakończenie</p> <p>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia. Po zarejestrowaniu otrzymasz e-mail z potwierdzeniem oraz Twoim biletem.<br/>Całość wydarzenia prowadzona będzie w języku polskim.</p> <p>1. “5 sekretów dobrych inżynierów oprogramowania.”</p> <p>Czysty kod to efekt splotu wielu ciekawych wydarzeń. Kod źródłowy opowiada historię nie tylko aplikacji, ale też człowieka który w danym momencie pisał kod. Historie najlepszych inżynierów z którymi pracowałem zasługują na talka w którym opowiem jakie ciekawe praktyki stosują, że ze spokojem Zen codziennie walczą o Feng shui kodu źródłowego.</p> <p>Marcin Kliks<br/>Team Lead zespołu developerskiego w Allegro. Miłośnik dobrego kodu, kultury Open Source, i ekspresywnych języków programowania. Zaangażowany w projekty Open Source Allegro np. Ralph <a href=\"https://github.com/allegro/ralph\" class=\"linkified\">https://github.com/allegro/ralph</a></p> <p>2. “Dystrybucja obciążenia w heterogenicznym świecie mikrousług” (prelekcja w języku angielskim)</p> <p>Proper load distribution is one of the keys to ensure smooth, safe and cost-effective operation of services. Heterogenous environments, however, turn this easy at first sight task into a challenge. This presentation tells about Allegro's solution for it.</p> <p>Roman Prykhodchenko<br/>Absolwent Wydziału Inżynierii Komputerowej Charkowskiego Narodowego Uniwersytetu Radioelektroniki. Przez ostatnie 6 lat pracował w dziedzinie przetwarzania w chmurze i automatyzacji, w tym wykonywał obowiązki core review w ramach opensource-owego projektu OpenStack w latach[masked]. Zwolennik filozofii DevOps oraz [programming polyglot]</p> <p>​3. \"Swiss Army Knife Pythonisty - ciekawe narzędzia developerskie.\"</p> <p>Narzędzia i organizacja są kluczowym elementem efektywnej pracy. Kim byłby programista bez odpowiedniej skrzynki z narzędziami? Na podstawie swoich doświadczeń postaram się przybliżyć mój zestaw kluczy i wytrychów poparty kilkuletnim doświadczeniem, od pisania setup.py, poprzez hooki na gicie, po tworzenie środowiska deweloperskiego od zera.</p> <p>Arkadiusz Adamski<br/>Inżynier oprogramowania, na co dzień pracujący w Allegro programujący głównie w Pythonie. Jeden z głównych programistów Ralph <a href=\"https://github.com/allegro/ralph\" class=\"linkified\">https://github.com/allegro/ralph</a>.</p> <p>4. \"Typehinty Pythonowe w produkcji - czy warto?\"</p> <p>Kilka przemyśleń o tym jak się sprawdzają Pythonowe typehinty na podstawie projektów Allegro. W jaki sposób nam pomagają i ułatwiają pracę, a gdzie przeszkadzają. Czy faktycznie pomogły nam uchronić się od błędów? Na koniec prezentacji postaram się odpowiedzieć na pytanie, czy warto ich używać na co dzień</p> <p>Marek Bleschke<br/>Programista z 7 letnim doświadczeniem, od niedawna kodujący w Allegro. Głównie związany z Pythonem i światem front-endu.</p> <p>5. \"Phobos - Intuition engineering w Allegro.\" (prelekcja w języku angielskim)</p> <p>On the monitoring team, our mission requires that we have a holistic understanding of the complex microservice architecture of Allegro. In this talk we’ll discuss intuition engineering — an approach to visualising traffic flow and architecture of micro service-based systems popularised by Netflix, and how it is applied to Allegro’s infrastructur.</p> <p>Tetiana Khotiaintseva<br/>Inżynier oprogramowania, w Allegro od pół roku. Programuje głównie w Pythonie. Jest miłośniczką czystego kodu, kultury devops i ciekawych wyzwań.</p> ",
        "duration": 11700000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "247801149",
        "link": "https://www.meetup.com/allegrotech/events/247801149/",
        "local_date": "2018-02-26",
        "local_time": "17:45",
        "name": "Allegro Tech Talks Poznań #8",
        "status": "past",
        "time": 1519663500000,
        "updated": 1519724538000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 82
    },
    {
        "created": 1517849464000,
        "description": "<p>Allegro Tech Labs to całodniowe, darmowe warsztaty w czasie których będziecie mogli poznać technologie z jakich korzystamy w Allegro. Prowadzone przez doświadczonych inżynierów, którzy rozwiązali już niejeden produkcyjny problem.</p> <p>Tematem pierwszych warsztatów będzie wprowadzenie do języka programowania Kotlin.<br/>Warsztaty prowadzone w języku polskim.<br/>Prosimy o zabranie swoich laptopów.</p> <p>REJESTRACJA:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> - prosimy o rejestrację poprzez przycisk \"Register\" przy opisie wydarzenia. Bez zarejestrowania się nie ma możliwości uczestniczenia w warsztatach.</p> <p>Agenda wydarzenia:<br/>09:00 - 09:20 - Rejestracja<br/>09:20 - 12:00 - Warsztaty<br/>12:00 - 13:00 - Lunch<br/>13:00 - 17:00 - Warsztaty</p> <p>Kotlin przebojem wdarł się na produkcję Allegro. Nasza nowa platforma do promowania ofert Allegro Ads prawie w całości została napisana w tym języku. Co ważne, nie tylko korzystamy z Kotlina - nasi inżynierowie biorą także aktywny udział w rozwoju jego ekosystemu. W czasie warsztatu Konrad Kamiński (autor integracji kotlinowych coroutines ze Spring) oraz Piotr Procner (inżynier Allegro) przybliżą Wam możliwości tego języka oraz pokażą jak w praktyce wykorzystać jego moc do pisania aplikacji biznesowych na Spring.</p> <p>Poruszane zagadnienia:<br/>- Data, czyli jak wykorzystać Kotlin do sprawnej organizacji danych w aplikacji.<br/>- Behaviour, czyli konstrukcje do opisu logiki w aplikacji.<br/>- Standard library, czyli co daje bibliotek standardowa Koltina.<br/>- Interop, czyli jak wprowadzić Kotlin do aplikacji biznesowej.</p> <p>Wymagania w stosunku do uczestników:<br/>Must have: dobra znajomość Java 8 i Spring 4.x<br/>Nice to have: znajomość Spock (framework testowy) i Gradle (build tool)</p> <p>Część praktyczna warsztatów odbywa się na komputerach uczestników, na których zainstalowane powinny być: JDK 8, IDE (najlepiej Idea), git</p> <p>Prowadzący:</p> <p>Konrad Kamiński<br/>Inżynier oprogramowania z dwudziestoletnim doświadczeniem na różnych stanowiskach - od developera po team ledera. Przez ostatnie 17 lat programował w technologiach opartych na JVM, w tym ostatnie 18 miesięcy prawie wyłącznie w Kotlinie. Prowadzi bloga i występuje na konferencjach (ostatnio KotlinConf San Francisco). Jest też kontrybutorem do projektów Open Source.</p> <p>Piotr Procner<br/>Full Stack developer z ponad sześcioletnim doświadczeniem. Swoją przygodę rozpoczął w branży mediowej od projektowania archiwów cyfrowych, teraz tworzy platformę reklamową dla Allegro. Wielki fan Kotlina, zainteresowany wytwarzaniem czystego kodu, dobrym nazewnictwem i czytelnością testów.</p> ",
        "duration": 28800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "247513717",
        "link": "https://www.meetup.com/allegrotech/events/247513717/",
        "local_date": "2018-02-17",
        "local_time": "09:00",
        "name": "Allegro Tech Labs Poznań # 1",
        "rsvp_limit": 25,
        "status": "past",
        "time": 1518854400000,
        "updated": 1519063075000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 25
    },
    {
        "created": 1517314495000,
        "description": "<p>Czy wiedzieliście, że biuro Allegro jest już w Krakowie 3 lata? Zapraszamy Was na wspólne świętowanie przy trzech prezentacjach wygłoszonych przez pracowników krakowskiego oddziału. Po prezentacji będzie okazja na ciekawe rozmowy w luźnej urodzinowej atmosferze:)</p> <p>ZAPISY: <a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a></p> <p>Agenda:</p> <p>18:00 - Rejestracja + networking<br/>18:30 - Hazelcast, sagi, strumienie i inne buzzwordy, Jarosław Pałka<br/>19:00 - Oczekiwanie na później docierające zdarzenia w środowisku rozproszonym, Bartłomiej Alberski<br/>19:30 - Produktywność w świecie rozproszonych usług, Dariusz Jędrzejczyk<br/>20:00 - integracja</p> <p>Lokalizacja: Browar Lubicz, Lubicz 17J,[masked] Kraków</p> <p>1. Hazelcast, sagi, strumienie i inne buzzwordy, Jarosław Pałka</p> <p>Ta prezentacja to pamiętnik z pola bitwy. Opowieść Hazelcast. O tym jak w Allegro powstawały zręby platformy marketing automation. O tym jak nowe wymaganie biznesowe otwiera nowe możliwości w obszarze technologii. Postaram się przedstawić nie tylko możliwości Hazelcast ale także jego mroczne strony i opowiedzieć o tym jakich zmian musieliśmy dokonać by zaadoptować na potrzeby naszej platformy.<br/>Budowanie własnego rozwiązania ma sens, lecz musicie być świadomi z jakimi problemami się spotkacie. Których będziecie starali się unikać jak ognia, a które z nich będziecie musieli rozwiązać sami. A jeśli jedyne co pozostanie po tej prezentacji w Waszych głowach, to świadomość, że kolejność zdarzeń ma znaczenie i wiedza na temat tego jak radzić sobie z tym w systemach rozproszonych, wówczas uznam to za swój mały sukces.</p> <p>Bio:<br/>Od ponad 15 lat w branży IT, jako administrator baz danych, programista, architekt, manager i „inżynier od spraw katastrof”.</p> <p>2. Oczekiwanie na później docierające zdarzenia w środowisku rozproszonym, Bartłomiej Alberski</p> <p>Zdarzenia w środowisku rozproszonym również mogą 'zabłądzić' (tak jak ludzie). Z tego powodu każda podjęta decyzja w momencie projektowania serwisów może ułatwić bądź też utrudnić radzenie sobie z takimi przypadkami. To, jakie rozwiązanie wybraliśmy kilka miesięcy temu, może wywołać uśmiech na twarzy (bądź też smutek) gdy będziemy wdrażać duże zmiany.<br/>W trakcie prezentacji zostanie przedstawionych kilka technik, ułatwiających operowanie systemów na produkcji - rozwiązań, które pozwolą nam na spokojny sen. W końcu poznamy sekret radzenia sobie z zagubionymi zdarzeniami.</p> <p>Bio:<br/>Inżynier oprogramowania z kilkuletnim doświadczeniem na co dzień pracujący nad „zbieraniem i liczeniem” danych. Ciągle uczy się nowych rzeczy rozwijając swoją wiedzę i umiejętności z zakresu systemów rozproszonych, uczenia maszynowego oraz sieci neuronowych.</p> <p>3. Produktywność w świecie rozproszonych usług, Dariusz Jędrzejczyk</p> <p>Czy zaczynając nowy projekt ogarnia Cię euforia?<br/>Z miłą chęcią wyklikasz sobie plan Continuous Integration, repozytorium, zdecydujesz gdzie trzymać hasła, zdecydujesz jak łączysz się z innymi usługami, założysz panele z metrykami, skonfigurujesz alarmy. Aha, jeszcze narzędzie do zarządzania zadaniami. Gdzieś trzeba przepchać logi, racja. Klucze ssh na maszynki też by się przydało. Gdzie ten pendrive?</p> <p>To chyba nie musi tak wyglądać. Gdybym powiedział Ci, że po 5 minutach możesz zacząć pisać logikę biznesową, a na tej prezentacji postawimy produkcyjnej jakości usługę, która rozmawia z inną to powiesz mi co jeszcze by się przydało?</p> <p>Chciałbym pokazać środowisko produktywnej pracy programisty, jednocześnie zapraszając do wymiany doświadczeń i pomysłów jak sprawić byśmy nie tracili cennego czasu a robili rzeczywiście nowe rzeczy. Kuluarowe dyskusje po prezentacji mile widziane</p> <p>Bio:<br/>Programista z dziewięcioletnim doświadczeniem zawodowym. Pracował w różnych środowiskach, na rozmaitych platformach - od gier i aplikacji mobilnych, przez monolityczne backendy, Big Data i przetwarzanie strumieniowe aż po mikroserwisy i rozproszone systemy wspierające platformę w chmurze.</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "247309730",
        "link": "https://www.meetup.com/allegrotech/events/247309730/",
        "local_date": "2018-02-08",
        "local_time": "18:00",
        "name": "Allegro Tech Talks #2 Kraków B-day Edition",
        "status": "past",
        "time": 1518109200000,
        "updated": 1518158827000,
        "utc_offset": 3600000,
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 88
    },
    {
        "created": 1517474566000,
        "description": "<p><b>AGENDA: </b></p> <p><b>1. Google Cloud ML Engine Platform</b> (Rafał Kluszczyński)</p> <p>Uczenie maszynowe jest jednym z najważniejszych obszarów sztucznej inteligencji, który coraz szerzej zyskuje na popularności. Nic więc dziwnego, że większość dostawców chmury obliczeniowej także przygotowuje dla klientów gotowe platformy umożliwiające przeprowadzanie obliczeń. Przykładem jest Google Cloud Machine Learning Engine, który dostarcza takie rozwiązania na podstawie TensorFlow. Podczas prezentacji, na prostym przykładzie wykorzystującym klasyfikację, zaprezentuję, jak wygląda aktualnie platforma Google Cloud ML Engine.</p> <p>2. <b>Deep learning - rewolucja w AI</b> (Łukasz Rączkowski)</p> <p>Uczenie maszynowe to szeroka i dynamicznie rozwijająca się dziedzina. W ostatnich latach szczególnie duże znaczenie ma tzw. deep learning. W mojej prezentacji przedstawię najważniejsze aspekty teoretyczne, gotowe narzędzia oraz zastosowania praktyczne. </p> <p><b>PRELEGENCI: </b></p> <p><b><br/></b></p> <p><b>Rafał Kluszczyński</b></p> <p>Pracownik Allegro od 2013 roku. Zawsze żywo zainteresowany obliczeniami i systemami rozproszonymi oraz problemami “wielkiej skali”. Wobec tematyki przetwarzania obrazów także nie pozostanie obojętny. Gorący zwolennik szeroko pojętej automatyzacji procesów IT.</p> <p><b>Łukasz Rączkowski</b></p> <p>Inżynier oprogramowania w Allegro. Łączy pracę zawodową z doktoratem na Uniwersytecie Warszawskim. Jego zainteresowania naukowe to bioinformatyka (dynamika molekularna), high-performance computing, uczenie maszynowe, computer vision. Chciałby zmienić świat na lepsze poprzez swoją pracę naukową.</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "247376871",
        "link": "https://www.meetup.com/allegrotech/events/247376871/",
        "local_date": "2018-02-07",
        "local_time": "18:00",
        "name": "Meet IT Toruń # 18",
        "status": "past",
        "time": 1518022800000,
        "updated": 1518039277000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "ul. Kościuszki 71",
            "city": "Toruń",
            "country": "pl",
            "id": 24266096,
            "lat": 53.02497482299805,
            "localized_country_name": "Poland",
            "lon": 18.625661849975586,
            "name": "Kościuszko Business Point",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 51
    },
    {
        "created": 1514985978000,
        "description": "<p>Zapraszamy na pierwszy w tym roku event frontendowy z serii Allegro Tech Talks w Poznaniu.</p> <p>Plan:<br/>17:45 - 18:15 - Rejestracja<br/>18:15 - 18:45- Wojciech Dzikowski - “Co siedzi pod maską, czyli jak działają silniki JavaScript”<br/>18:45 - 18:55 - Przerwa kawowa<br/>18:55 - 19:25 - Sergey Bolshov - “Allegro, vivo, presto”<br/>19:25 - 20:00 - Przerwa<br/>20:00 - 20:30 - Piotr Siwiński - “Widziałem co zrobiłeś!”<br/>20:30 - 20:40 - Zakończenie</p> <p>REJESTRACJA: Prosimy o zarejestrowanie się na <a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a> poprzez przycisk \"register\" przy opisie wydarzenia. Po kilku minutach od rejestracji otrzymasz e-mail z potwierdzeniem oraz Twoim biletem.</p> <p>1. “Co siedzi pod maską, czyli jak działają silniki JavaScript”</p> <p>Co się dzieje z plikiem JS od pobrania do wykonania i dlaczego czasami aż tyle to trwa? Przejdziemy całą ścieżkę parsowania, kompilacji i optymalizacji. Porównamy dostępne silniki JavaScriptowe, poznamy zasady ich działania i zastanowimy się co można zrobić, żeby nasz kod działał szybciej.</p> <p>Wojciech Dzikowski</p> <p>Frontendowiec z ponad siedmioletnim stażem, od roku w Allegro. Ceniący wydajny i czysty kod ponad narzędzia i frameworki. Lubi wyzwania algorytmiczne, ale jak trzeba to napisze też CSSy dla Internet Explorera.</p> <p>2. “Allegro, vivo, presto”</p> <p>Wielu developerów nie zdaje sobie sprawy, że czas odpowiedzi z serwera to często mniej niż 20% czasu ładowania strony. To dlatego, że łatwo przeoczyć różnicę w prędkości działania strony na błyszczącym MacBooku połączonym szerokopasmowym łączem, a telefonem przeciętnego Kowalskiego korzystającego z sieci 3G.<br/>Podczas prezentacji powiem o tym jak wydajność przekłada się na cele biznesowe i dlaczego stwierdzenie, że strona jest załadowana nie jest takie proste jak się wydaje. Przedstawię też jak monitorujemy szybkość ładowania stron w Allegro oraz jakie są główne problemy, które obserwujemy. Opowiem również jak sobie z nimi radzić przy pomocy technologii takich jak SPA, HTTP/2 i AMP.</p> <p>Sergey Bolshov</p> <p>Jest pasjonatem technologii webowych. Stara się pisać możliwie najlepszej jakości kod. Stosuje TDD, naprawia messy style za pomocą BEM, nie cierpi ostrzeżeń lintera i nie sformatowanego kodu. Jego motto: 'NO UGLY HACKS!'</p> <p>3. \"Widziałem co zrobiłeś!\"</p> <p>Frontend, czy chcesz tego czy nie, zawsze w jakiś sposób będzie warstwą widoczną dla użytkownika, czy są to super zaawansowane javascripty czy pięknie skomplikowane CSS. Zatem jaki język komunikacji musisz poznać i z kim się zaprzyjaźnić by móc konstruktywnie skakać sobie do oczu, aby tworzyć lepszy design? Co to znaczy, że musisz być uparty, no i ostatecznie jak możesz sobie ułatwić development poprzez dobranie lub zbudowanie odpowiednich narzędzi?</p> <p>Piotr Siwiński</p> <p>Humanista w świecie IT. Frontendowiec z siedemnastoletnim stażem. W Allegro już dziesięć lat. Człowiek od styleguidów i niskopoziomowego CSS. Biegły w mowie i piśmie, po to, żeby opowiedzieć o pomysłach, projektach, sytuacji na świecie lub filozoficzno-psychologicznych rozmyślaniach.</p> ",
        "duration": 14400000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "246444391",
        "link": "https://www.meetup.com/allegrotech/events/246444391/",
        "local_date": "2018-01-29",
        "local_time": "18:00",
        "name": "Allegro Tech Talks Poznań #7",
        "status": "past",
        "time": 1517245200000,
        "updated": 1517415666000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Grunwaldzka 182",
            "city": "Poznań",
            "country": "pl",
            "id": 23767217,
            "lat": 52.391578674316406,
            "localized_country_name": "Poland",
            "lon": 16.857398986816406,
            "name": "Pixel ",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 109
    },
    {
        "created": 1514983530000,
        "description": "<p>Przedstawiamy Wam nową inicjatywę Allegro Tech: Allegro Tech Labs. Jest to cykl całodniowych, darmowych warsztatów, w czasie których będziecie mogli poznać technologie z jakich korzystamy w Allegro. Prowadzone przez doświadczonych inżynierów, którzy rozwiązali już niejeden produkcyjny problem.</p> <p>Rejestracja:<br/><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a><br/>- prosimy o rejestrację poprzez przycisk register przy opisie wydarzenia.</p> <p>Prosimy o zabranie swoich laptopów.</p> <p>Tematem drugich warsztatów będzie:<br/>RxJava 2 dla początkujących - Tomasz Nurkiewicz</p> <p>Szkolenie dla programistów Javy, którzy chcieliby efektywnie wykorzystywać RxJavę 2.x w swoich projektach lub przyszło im takie projekty utrzymywać. Będą to warsztaty pozbawione slajdów. Skupimy się na aspektach rzadziej poruszanych i nieco gorzej udokumentowanych jak poprawna wielowątkowość i testowanie.</p> <p>Dlaczego warto uczestniczyć w warsztacie?</p> <p>* Nauczysz się jak i kiedy wykorzystywać RxJavę<br/>* Zrozumiesz jak działa model wielowątkowości<br/>* Poznasz techniki testowania reaktywnego kodu, zwłaszcza opartego o upływ czasu (schedulowanie, timeouty)</p> <p>Warsztat to w stu procentach ćwiczenia praktyczne, zero slajdów i minimum wykładu</p> <p>Wymagania:<br/>dobra znajomość Java 8. Całość warsztatów odbywa się na komputerach uczestników, na których zainstalowane powinny być: JDK 8, IDE, git. Przed szkoleniem sklonuj projekt: <a href=\"https://github.com/nurkiewicz/rxjava-workshop\" class=\"linkified\">https://github.com/nurkiewicz/rxjava-workshop</a> i postępuj zgodnie z instrukcjami z pliku README.MD.</p> <p>Agenda wydarzenia:</p> <p>09:00 - 09:20 - Rejestracja</p> <p>09:20 - 12:00 - Warsztaty</p> <p>12:00 - 13:00 - Lunch</p> <p>13:00 - 17:00 - Warsztaty</p> <p>Plan szkolenia:</p> <p>1. Co to jest RxJava<br/>2. Skąd się biorą strumienie<br/>3. Pule wątków<br/>4. flatMap() i parallel() - wielowątkowość w praktyce<br/>5. zip() - łączenie strumieni<br/>6. Okna i bufory<br/>7. Błędy, ponawianie<br/>8. Zaawansowane testowanie<br/>9. Backpressure</p> <p><a href=\"https://github.com/nurkiewicz/rxjava-workshop/tree/master/src/test/java/com/nurkiewicz/rxjava\" class=\"linkified\">https://github.com/nurkiewicz/rxjava-workshop/tree/master/src/test/java/com/nurkiewicz/rxjava</a></p> <p>O trenerze:<br/>Tomasz Nurkiewicz - autor książki o RxJavie (<a href=\"https://www.amazon.com/Reactive-Programming-RxJava-Asynchronous-Applications/dp/1491931655\" class=\"linkified\">https://www.amazon.com/Reactive-Programming-RxJava-Asynchronous-Applications/dp/1491931655</a>). Zawodowo programista w Allegro.</p> ",
        "duration": 28800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "246443420",
        "link": "https://www.meetup.com/allegrotech/events/246443420/",
        "local_date": "2018-01-13",
        "local_time": "09:00",
        "name": "Allegro Tech Labs # 2",
        "rsvp_limit": 25,
        "status": "past",
        "time": 1515830400000,
        "updated": 1516005133000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "al. Jana Pawła II 22, Warszawa",
            "city": "Warsaw",
            "country": "pl",
            "id": 25185284,
            "lat": 52.23618698120117,
            "localized_country_name": "Poland",
            "lon": 20.999486923217773,
            "name": "Allegro Office Q22",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 25
    },
    {
        "created": 1512127057000,
        "description": "<p>Gorąco zapraszamy na mikołajkową edycję Meet IT Toruń! </p> <p><b>AGENDA</b></p> <p><b><i>1. Jak przygotować firmę do RODO: prawa podmiotów danych, cyber-zagrożenia, bezpieczeństwo oraz ocena skutków dla ochrony danych i analiza ryzyka w kontekście zasady rozliczalności </i></b><i>(Mariola Więckowska)</i></p> <p>- Przykładowe podejścia do wdrożenia RODO w organizacji.<br/>- Odpowiedzialność Administratora za przetwarzanie danych oraz powierzenie przetwarzania danych w tym również w chmurze.<br/>- Sposoby wypełniania praw podmiotów danych w procesach manualnych i automatycznych w systemach IT.<br/>- Dane osobowe, anonimowe, preudonimizacja.<br/>- Cyber-zagrożenia oraz dobór odpowiednich środków zabezpieczeń.<br/>- Profilowanie i śledzenie zachowań użytkowników w kontekście RODO.<br/>- Wykazanie stosowania zasady rozliczalności poprzez ocenę skutków dla ochrony danych (OSOD) - privacy by design/by default.<br/>- Analiza ryzyk w RODO - ryzyko przetwarzania danych, ryzyko prywatności.</p> <p><i><b>2. Allegro, vivo, presto </b>(Mateusz Sulima)</i></p> <p>Wielu developerów nie zdaje sobie sprawy, że czas odpowiedzi z serwera to często mniej niż 20% czasu ładowania strony. To dlatego, że łatwo przeoczyć różnicę w prędkości działania strony na błyszczącym MacBooku połączonym szerokopasmowym łączem a telefonem przeciętnego Kowalskiego korzystającego z sieci 3G. Tymczasem już połowa ruchu w polskim internecie odbywa się z urządzeń mobilnych, co powoduje, że wracamy do czasów, gdy każdy bajt i linijka kodu miały znaczenie.<br/>Podczas prezentacji powiem o tym, jak wydajność przekłada się na cele biznesowe i dlaczego stwierdzenie, że strona jest załadowana, nie jest takie proste jak się wydaje. Przedstawię też jak monitorujemy szybkość ładowania stron w Allegro oraz jakie są główne problemy, które obserwujemy. Opowiem również, jak sobie z nimi radzić przy pomocy technologii takich jak SPA, HTTP/2 i AMP.</p> <p><b>Mariola Więckowska </b><br/>Doświadczona Administrator Bezpieczeństwa Informacji (ABI) / Data Protection Officer (DPO), obecnie w Grupie Allegro, Ceneo i Grupie OLX (olx.pl, OtoMoto.pl i OtoDom.pl). Członek IAPP (International Association of Privacy Professionals), SABI (Stworzyszenia Administratorów Bezpieczeństwa Informacji) oraz ISSA (Information Systems Security Association). Jest absolwentem kierunków IT, bezpieczeństwa informacji, zarządzania przedsiębiorstwem, zarządzania projektami IT oraz European Data Protection Law Summer School na Brussels Privacy Hub Vrije Universiteit Brussel.<br/>Blisko 20 lat kierowała zespołem IT w bankowości i sektorze giełdowym. W swojej obecnej roli łączy wieloletnie doświadczenie IT, w tym współpracę z Giełdą Papierów Wartościowych w Warszawie i KNF z obecną praktyką w obszarze bezpieczeństwa informacji i ochrony danych osobowych.<br/>Nadzoruje wypełnianie obowiązków Ustawy o Ochronie Danych Osobowych, Rozporządzeń EU i polskich. Jako praktyk na co dzień doświadczający wszelkich ich aspektów. Swoim doświadczeniem dzieli się ze studentami na Podyplomowych Studiach na kierunku Administrator Bezpieczeństwa Informacji w Wyższej Szkole Bankowej w Poznaniu oraz Ochrona Danych Osobowych i Informacji Niejawnych w Akademi Leona Koźmińskiego.</p> <p><b>Mateusz Sulima </b><br/>Od pół roku pełni w Allegro rolę Web Performance Engineer. Prowadzi analizy prędkości działania serwisu od strony użytkownika końcowego, czyli front-endu. Pracuje też z zespołami nad rozwiązaniem znalezionych problemów, najczęściej optymalizując kod JavaScript i CSS, ale czasami dotykając też warstwy sieciowej. Wcześniej zajmował się rozwojem systemów rekomendacji i reklam, również często rozwiązując problemy wydajnościowe, tam jednak w środowisku JVM.</p> ",
        "duration": 10800000,
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "245556960",
        "link": "https://www.meetup.com/allegrotech/events/245556960/",
        "local_date": "2017-12-06",
        "local_time": "18:00",
        "name": "Meet IT Toruń # 17",
        "status": "past",
        "time": 1512579600000,
        "updated": 1512647590000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "ul. Kościuszki 71",
            "city": "Toruń",
            "country": "pl",
            "id": 24266096,
            "lat": 53.02497482299805,
            "localized_country_name": "Poland",
            "lon": 18.625661849975586,
            "name": "Kościuszko Business Point",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 43
    },
    {
        "created": 1509361217000,
        "description": "<p>All presentations will be delivered in English</p> <p><b>REMEMBER TO REGISTER ON OUR BLOG! WITHOUT THIS YOU WON'T BE ABLE TO ENTER THE MEETUP </b></p> <p><a href=\"https://allegro.tech/events/\"><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a></a> (PLEASE USE REGISTER BUTTON - few minutes after registration you will receive confirmation e-mail together with a ticket) </p> <p><img src=\"https://secure.meetupstatic.com/photos/event/b/e/2/8/600_466188680.jpeg\" /></p> <p><b>Schedule</b></p> <p>18:00 - Registration starts (+ Networking &amp; pizza) </p> <p>18:30 - Debug-Companion Tomasz Ziarko</p> <p>19:30 - Container 2.0 (Johannes Unterstein)</p> <p><b>Debug-Companion</b></p> <p>Switching from VMs to Mesos has a lot of benefits for developers, but also one huge drawback: they are no longer in full control of the environment. For JVM this means losing access to tools like jstat, jmap, or perf. Giving full access to all containers on Mesos is too dangerous while asking ops each time a developer wants to create a heapdump contradicts all DevOps principles.</p> <p>This is why we decided to take a different approach and give back the power to the developers. During this talk we will present different problems with debugging apps on our Mesos cluster running 400+ services operated by 40 development teams. We will cover security and stability concerns and present our solution: debug-companion.</p> <p><b>Tomasz Ziarko </b></p> <p>Programmer/Engineer with 7 years experience, on a daily basis dealing with cloud infrastructure in Allegro.pl, specifically with Mesos and Openstack. A supporter of open source software.</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/b/e/3/3/600_466188691.jpeg\" /></p> <p><b>Container 2.0</b></p> <p>In the past year, we migrated our applications to containers to isolate our applications and made them easily shippable. But now we are struggling running stateful applications to make them scalable and fault tolerant. And we run our big data and fast data frameworks in separate clusters because it is not super easy to integrate this into our current container stack. This means that our cluster utilization is not optimal and we resign scaling effects comprehensive containers and big data frameworks. Florian Leibert (Mesosphere, CEO) calls this phenomenon Container 2.0 and we will discuss this topic in this session.<br/>In this session, we will look at current container usages and show the actual problem. After this, we will see how DC/OS and Apache Mesos delivers Container 2.0 to optimize cluster resource sharing for all parts of your application.<br/> <br/><b>Johannes Unterstein</b> (@unterstein)</p> <p>organizes the Java user group in his hometown Kassel, teaches at DHBW Stuttgart and works as a distributed applications engineer at Mesosphere. He is working at the Marathon container orchestration framework to provide Twitter scale for everyone. In his previous life, he worked in java projects for large German customers. Besides his fascination for container orchestration, he loves to talk about elasticsearch and Neo4j.</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/b/e/3/5/600_466188693.jpeg\" /></p> ",
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "244649142",
        "link": "https://www.meetup.com/allegrotech/events/244649142/",
        "local_date": "2017-12-06",
        "local_time": "18:00",
        "name": "Allegro Tech Talks Warszawa #5",
        "status": "past",
        "time": 1512579600000,
        "updated": 1512598213000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "al. Jana Pawła II 22, Warszawa",
            "city": "Warsaw",
            "country": "pl",
            "id": 25185284,
            "lat": 52.23618698120117,
            "localized_country_name": "Poland",
            "lon": 20.999486923217773,
            "name": "Allegro Office Q22",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 89
    },
    {
        "created": 1509360516000,
        "description": "<p>Jest nam niezmiernie miło ogłosić pierwszy Allegro Tech Talks w Krakowie!</p> <p>Razem z DreamLab przygotowaliśmy dla Was meetup o tematyce frontendu i webperformance'u<b>. </b></p> <p>Zapraszamy!</p> <p><b>Uwaga! Żeby wziąć udział w spotkaniu należy zarejestrować się przez formularz: <a href=\"https://allegro.tech/events/\"><a href=\"https://allegro.tech/events/\" class=\"linkified\">https://allegro.tech/events/</a></a></b></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/9/a/7/4/600_466359540.jpeg\" /></p> <p><b><a href=\"https://allegro.tech/events/\"><br/></a></b></p> <p><b>Agenda:</b></p> <p>18:00 - 18:30 - rejestracja + networking + finger foods</p> <p>18:30 - 20:30 - prezentacje:</p> <p>1. Allegro, vivo, presto - Mateusz Sulima (Allegro)</p> <p>2. Simple questions at Internet scale - Piotr Turek (DreamLabs)</p> <p><b>1. Allegro, vivo, presto</b></p> <p>Wielu developerów nie zdaje sobie sprawy, że czas odpowiedzi z serwera to często mniej niż 20% czasu ładowania strony. To dlatego, że łatwo przeoczyć różnicę w prędkości działania strony na błyszczącym MacBooku połączonym szerokopasmowym łączem, a telefonem przeciętnego Kowalskiego korzystającego z sieci 3G. Tymczasem już połowa ruchu w polskim internecie odbywa się z urządzeń mobilnych, co powoduje, że wracamy do czasów gdy każdy bajt i linijka kodu miały znaczenie.<br/>Podczas prezentacji powiem o tym jak wydajność przekłada się na cele biznesowe i dlaczego stwierdzenie, że strona jest załadowana nie jest takie proste jak się wydaje. Przedstawię też jak monitorujemy szybkość ładowania stron w Allegro oraz jakie są główne problemy, które obserwujemy. Opowiem również jak sobie z nimi radzić przy pomocy technologii takich jak SPA, HTTP/2 i AMP.</p> <p><b>Mateusz Szulima (Allegro)</b></p> <p>Od pół roku pełni w Allegro rolę Web Performance Engineer. Prowadzi analizy prędkości działania serwisu od strony użytkownika końcowego, czyli front-endu. Pracuje też z zespołami nad rozwiązaniem znalezionych problemów, najczęściej optymalizując kod JavaScript i CSS, ale czasami dotykając też warstwy sieciowej. Wcześniej zajmował się rozwojem systemów rekomendacji i reklam, również często rozwiązując problemy wydajnościowe, tam jednak w środowisku JVM.</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/1/0/a/4/600_465844260.jpeg\" /></p> <p><b>2. Simple questions at Internet scale</b></p> <p>W skali Internetu i ogromu danych, które przez niego przepływają, rzeczy pozornie banalne stają się trudne. Szybka i wydajna odpowiedź na proste pytania takie jak: “czy ten element wystąpił już wcześniej?”, “ile unikalnych elementów jest w tym zbiorze?” czy “Jaki jest rozkład ich wartości?” staje się mocno nieoczywista. W swojej pracy, częściej niż nam się wydaje, używamy odpowiedzi na te i podobne pytania, ale czy rozumiemy jak i dlaczego działają? Podczas prezentacji spróbujemy wspólnie zbudować i zrozumieć kilka nadzwyczaj użytecznych i zaskakująco potężnych algorytmów używanych do odpowiedzi na nie. Przy okazji zaskoczy nas, że w ogóle mają prawo działać, odkryjemy kilka ciekawych, powtarzających się wzorców w ich budowie, a być może zobaczymy też szereg miejsc w swoich produktach, w których moglibyśmy zastosować te lub podobne rozwiązania.</p> <p><b>Piotr Turek (DreamLab)</b></p> <p>Fascynat systemów rozproszonych i rozwiązywania problemów biznesowych w wielkiej skali. Aktualnie zajmuje się hodowlą<a href=\"https://pixelastic.github.io/pokemonorbigdata/\"> Pokemonów Big Data</a> w<b> DreamLabie</b>, jako BigData Architect i Team Leader zespołu odpowiedzialnego za budowę systemów automatyzacji procesów wydawniczych (w tym personalizacyjnych i rekomendacyjnych) oraz wdrażanie ich w kilkudziesięciu znanych markach mediowych z 6 krajów Europy, używanych codziennie przez miliony internautów. Wcześniej hodował różne rodzaje Pokemonów w Google, Base CRM i CERN, używając wszelkich właściwych narzędzi i technologii. Nie lubi rozmawiać o<i>f rameworkach</i>, zamykać siebie i innych w pudełkach z etykietkami - nie chce przyznać, że w głębi duszy jest Java Developerem.</p> <p><img src=\"https://secure.meetupstatic.com/photos/event/8/c/2/7/600_466355879.jpeg\" /></p> <p><b>_____ </b></p> <p><b>DreamLab</b></p> <p>W DreamLabie powstaje teraźniejszość i przyszłość cyfrowych mediów. Z czym się mierzymy? Gigabajty ruchu na sekundę, miliony użytkowników, miliardy requestów, kilka niezależnych portali i ich redakcji, kilkadziesiąt źródeł automatycznie pozyskiwanego contentu, platformy wideo i eCommerce, a do tego wyzwania z obszarów Mobile, Big Data a to wszystko w nowoczesnym środowisko rozproszonym.</p> <p>Jesteśmy częścią międzynarodowej grupy medialnej. Działamy w ramach Grupy Onet-RAS Polska i specjalizujemy się w technologiach dla nowych mediów.</p> <p><b><a href=\"http://www.dreamlab.pl\">www.dreamlab.pl</a></b></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/5/a/8/8/600_465863176.jpeg\" /></p> <p>_____</p> <p><b>Allegro Tech Talks</b></p> <p>to cykl spotkań, w czasie których znakomici prelegenci mówią o projektach, które w Allegro realizujemy, o problemach, z którymi zdarza nam się mierzyć oraz oryginalnych rozwiązaniach, które implementujemy. Jako że zawsze jesteśmy otwarci na różnorodność perspektyw i tematów, wśród prezentujących nie zabraknie także gości spoza naszej organizacji.</p> <p><a href=\"https://www.youtube.com/watch?v=A44ZgFhDBQY\" class=\"embedded\">https://www.youtube.com/watch?v=A44ZgFhDBQY</a></p> ",
        "group": {
            "created": 1425052059000,
            "id": 18465254,
            "join_mode": "open",
            "lat": 52.2599983215332,
            "localized_location": "Warsaw, Poland",
            "lon": 21.020000457763672,
            "name": "allegro Tech",
            "region": "en_US",
            "urlname": "allegrotech",
            "who": "Techs"
        },
        "id": "244648944",
        "link": "https://www.meetup.com/allegrotech/events/244648944/",
        "local_date": "2017-11-30",
        "local_time": "18:00",
        "name": "Allegro Tech Talks Kraków #1",
        "rsvp_limit": 140,
        "status": "past",
        "time": 1512061200000,
        "updated": 1512074593000,
        "utc_offset": 3600000,
        "venue": {
            "address_1": "Rajska 12",
            "city": "Kraków",
            "country": "pl",
            "id": 25588306,
            "lat": 50.06437683105469,
            "localized_country_name": "Poland",
            "lon": 19.92969512939453,
            "name": "Pauza in garden",
            "repinned": false
        },
        "visibility": "public",
        "waitlist_count": 0,
        "yes_rsvp_count": 68
    }
]
